import matplotlib.pyplot as plt

# 假设你有一组x和y坐标
# client 1
x1_1 =list(range(13))
y1_1 = [2.290583372116089, 2.1130897998809814, 2.0049047470092773, 1.9392083883285522, 1.8882129192352295, 1.842298150062561, 1.8047592639923096, 1.7733385562896729, 1.7470194101333618, 1.7233970165252686, 1.7024447917938232, 1.6836557388305664, 1.6671135425567627]
x1_1_1 =[12,13]
y1_1_1=[1.6671135425567627,0.9183489084243774]
x1_2 =list(range(13, 24))
y1_2=[0.9183489084243774, 0.9038235545158386, 0.8926030993461609, 0.8833688497543335, 0.8749328851699829, 0.8670623898506165, 0.8605208396911621, 0.8548022508621216, 0.8493510484695435, 0.8441940546035767, 0.8393665552139282]
x1_1_2 =[23,24]
y1_1_2=[0.8393665552139282,0.6967769265174866]
x1_3 =list(range(24, 35))
y1_3=[0.6967769265174866, 0.6969822645187378, 0.6966032981872559, 0.6959781646728516, 0.6954140067100525, 0.6948063969612122, 0.6942253708839417, 0.6936227083206177, 0.6931208372116089, 0.6926495432853699, 0.6923452615737915]
x1_1_3 =[34,35]
y1_1_3=[0.6923452615737915,0.3343825340270996]
x1_4=list(range(35, 46))
y1_4=[0.3343825340270996, 0.3339504301548004, 0.33352622389793396, 0.33315935730934143, 0.33280953764915466, 0.33244019746780396, 0.33207574486732483, 0.33174747228622437, 0.33144640922546387, 0.3311774432659149, 0.3309316635131836]
x1_1_4 =[45,46]
y1_1_4=[0.3309316635131836,0.23986521363258362]
x1_5=list(range(46, 57))
y1_5=[0.23986521363258362, 0.23979154229164124, 0.2397477924823761, 0.2396860420703888, 0.23963403701782227, 0.23957566916942596, 0.23951275646686554, 0.23944969475269318, 0.23938865959644318, 0.23932233452796936, 0.23924973607063293]
# x2 = [6, 7, 8, 9, 10]
# y2 = [1, 4, 9, 16, 25]

x2_1 =list(range(11))
y2_1 =[1.7469642162322998, 1.6363680362701416, 1.582818865776062, 1.5462476015090942, 1.5172855854034424, 1.4948058128356934, 1.4764573574066162, 1.4608041048049927, 1.447637915611267, 1.4365222454071045, 1.4271973371505737]
x2_1_1=[10,11]
y2_1_1=[1.4271973371505737,0.9983426332473755]
x2_2 =list(range(11, 22))
y2_2=[0.9983426332473755, 0.9868924021720886, 0.977960467338562, 0.9704896211624146, 0.9634684324264526, 0.9570525884628296, 0.9511150121688843, 0.9458362460136414, 0.941356360912323, 0.9372366070747375, 0.9335169792175293]
x2_1_2=[21,22]
y2_1_2=[0.9335169792175293,0.7976672053337097]
x2_3 =list(range(22, 33))
y2_3=[0.7976672053337097, 0.7843649387359619, 0.7757366895675659, 0.7697036862373352, 0.7648876309394836, 0.7610987424850464, 0.7576874494552612, 0.7546841502189636, 0.751951277256012, 0.7494670152664185, 0.7471477389335632]
x2_1_3=[32,33]
y2_1_3=[0.7471477389335632,0.3656434118747711]
x2_4=list(range(33, 44))
y2_4=[0.3656434118747711, 0.36453208327293396, 0.36386749148368835, 0.36330291628837585, 0.3626452386379242, 0.362008273601532, 0.3613913953304291, 0.3607276380062103, 0.3600723445415497, 0.3595637381076813, 0.35905224084854126]
x2_1_4=[43,44]
y2_1_4=[0.35905224084854126,0.14921684563159943]
x2_5=list(range(44, 55))
y2_5=[0.14921684563159943, 0.1490979939699173, 0.14898663759231567, 0.14890176057815552, 0.14884936809539795, 0.1488138735294342, 0.14876893162727356, 0.14871826767921448, 0.1486763060092926, 0.14863494038581848, 0.14859092235565186]
# 创建一个新的图形
plt.rcParams['font.sans-serif'] = ['SimHei']  # 使用黑体
plt.rcParams['axes.unicode_minus'] = False  # 正确显示负号
plt.figure(figsize=(15, 10))
# from matplotlib.font_manager import FontProperties
# font = FontProperties(size=14)
# 绘制线条并显示点，设置点的大小较大以加粗显示
plt.plot(x1_1, y1_1, 'b-', marker='o', markerfacecolor='blue', markeredgecolor='black', linewidth=1,
         label='客户端 0')
plt.plot(x1_1_1, y1_1_1, 'r--',label='客户端 0 本地训练和模型聚合过程')
plt.plot(x1_2, y1_2, 'b-', marker='o', markerfacecolor='blue', markeredgecolor='black', linewidth=1)
plt.plot(x1_1_2, y1_1_2, 'r--')
plt.plot(x1_3, y1_3, 'b-', marker='o', markerfacecolor='blue', markeredgecolor='black', linewidth=1)
plt.plot(x1_1_3, y1_1_3, 'r--')
plt.plot(x1_4, y1_4, 'b-', marker='o', markerfacecolor='blue', markeredgecolor='black', linewidth=1)
plt.plot(x1_1_4, y1_1_4, 'r--')
plt.plot(x1_5, y1_5, 'b-', marker='o', markerfacecolor='blue', markeredgecolor='black', linewidth=1)
# # 绘制第一条线，使用红色实线
# plt.plot(x1, y1, 'r-', label='Line 1')
# 绘制第二条线，使用蓝色虚线
# plt.plot(x2, y2, 'b--', label='Line 2')

plt.plot(x2_1, y2_1, 'g-', marker='*', markerfacecolor='green', markeredgecolor='black', linewidth=1,
         label='客户端 1')
plt.plot(x2_1_1, y2_1_1, 'y--',label='客户端 1 本地训练和模型聚合过程')
plt.plot(x2_2, y2_2, 'g-', marker='*', markerfacecolor='green', markeredgecolor='black', linewidth=1)
plt.plot(x2_1_2, y2_1_2, 'y--')
plt.plot(x2_3, y2_3, 'g-', marker='*', markerfacecolor='green', markeredgecolor='black', linewidth=1)
plt.plot(x2_1_3, y2_1_3, 'y--')
plt.plot(x2_4, y2_4, 'g-', marker='*', markerfacecolor='green', markeredgecolor='black', linewidth=1)
plt.plot(x2_1_4, y2_1_4, 'y--')
plt.plot(x2_5, y2_5, 'g-', marker='*', markerfacecolor='green', markeredgecolor='black', linewidth=1)
# 设置横坐标的刻度标签字体大小
plt.xticks(fontsize=22)  # 调整x轴刻度标签字体大小

# 设置纵坐标的刻度标签字体大小
plt.yticks(fontsize=22)  # 调整y轴刻度标签字体大小

# 也可以同时设置刻度标签的其他属性，如颜色、旋转角度等
# plt.xticks(rotation=45, color='blue')  # 设置x轴刻度标签旋转角度和颜色
# plt.yticks(color='red')  # 设置y轴刻度标签颜色
# 添加图例
# plt.legend()
legend = plt.legend(loc='best', fontsize=20, ncol=1, handletextpad=0.5)
# 设置图例的边框宽度（可选）
frame = legend.get_frame()
frame.set_alpha(0.5)  # 设置边框透明度
frame.set_linewidth(1)  # 设置边框宽度
# 设置标题和坐标轴标签
plt.title('权重参数训练过程',fontsize=22)
plt.xlabel('权重参数训练轮次',fontsize=22)
plt.ylabel('损失值',fontsize=22)

# 显示网格
plt.tight_layout()
plt.grid(True)
plt.savefig('ALA权重训练.png')
# 显示图形
plt.show()